# Core
brew "neovim"
brew "tmux"
brew "lazygit"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "jq"
brew "pnpm"
brew "gh"
brew "uv"
brew "imagemagick"

# Terminal & Window Manager
cask "ghostty"
cask "nikitabobko/tap/aerospace"

# Fonts
cask "font-fira-code-nerd-font"

# AI
cask "claude-code"
cask "claude"

# Applications
cask "firefox"
cask "slack"
